DataProcessors/ДМ_ЗаполнениеНомераПлантаВПредприятиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ДМ_ЗаполнениеНомераПлантаВПредприятиях</Name>
			<Comment>Установка значения реквизита ДМ_НомерПланта в справочнике Предприятия</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Предприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДМ_НомерПланта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Предприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Предприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.СкладыУчетнойСистемы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРоссийскогоПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПредприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеятельностьОсуществляемаяПредприятием</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПоставившийНаУчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентСобственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНомеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПредприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_ГлобальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_НомерПланта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_ПечатьТВСД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автогашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ДМ_ЗаполнениеНомераПлантаВПредприятиях/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Объект.Предприятия.Очистить();
	лЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Предприятия.Ссылка КАК Ссылка,
	|	Предприятия.ДМ_НомерПланта КАК ДМ_НомерПланта,
	|	Предприятия.Наименование КАК Наименование,
	|	Предприятия.ДМ_Организация КАК ДМ_Организация
	|ИЗ
	|	Справочник.Предприятия КАК Предприятия
	|ГДЕ
	|	Предприятия.ПометкаУдаления = ЛОЖЬ
	|	И (Предприятия.ДМ_НомерПланта < ""0""
	|			ИЛИ Предприятия.ДМ_Организация = &ДМ_Организация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование"
	);
	лПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
	лЗапрос.УстановитьПараметр( "ДМ_Организация", лПустаяОрганизация );
	лРезультат = лЗапрос.Выполнить();
	Если лРезультат.Пустой() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru = 'Нет предприятий без номера планта'") );
		Возврат;
	
	КонецЕсли;
	
	лВыборка = лРезультат.Выбрать();
	Пока лВыборка.Следующий() Цикл
		
		лНоваяСтрока = Неопределено;
		лНомерПланта = "";
		лОрганизация = лПустаяОрганизация;
		
		Если ПустаяСтрока(лВыборка.ДМ_НомерПланта) Тогда
			лНаименование = СокрЛП(лВыборка.Наименование);
			лНомерПланта = Прав( лНаименование, 5 );
			лНомерПланта = СокрЛП(лНомерПланта);
			Если СтрДлина( лНомерПланта ) = 4 Тогда
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке( лНомерПланта ) Тогда
					лНоваяСтрока = Объект.Предприятия.Добавить();
					лНоваяСтрока.ДМ_НомерПланта = лНомерПланта;
				Иначе
					лНомерПланта = "";
				КонецЕсли;
			Иначе
				лНомерПланта = "";
			КонецЕсли;
		Иначе
			лНомерПланта = лВыборка.ДМ_НомерПланта;
		КонецЕсли;
		
		Если лНомерПланта <> "" Тогда
		
			Если лВыборка.ДМ_Организация = лПустаяОрганизация Тогда
			
				лОрганизация = ДМ_СлужебныйПривилегированный.НайтиЭлементСправочникаПоРеквизиту( "Организации", "ДМ_КодSAP", лНомерПланта );
				Если лОрганизация <> лПустаяОрганизация Тогда
					Если лНоваяСтрока <> Неопределено Тогда
						лНоваяСтрока.Организация = лОрганизация;
					Иначе
						лНоваяСтрока = Объект.Предприятия.Добавить();
						лНоваяСтрока.ДМ_НомерПланта = лНомерПланта;
						лНоваяСтрока.Организация = лОрганизация;
					КонецЕсли;
				КонецЕсли;
			
			Иначе
				лОрганизация = лВыборка.ДМ_Организация;
				Если лНоваяСтрока <> Неопределено Тогда
					лНоваяСтрока.Организация = лВыборка.ДМ_Организация;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
		
		Если лНоваяСтрока <> Неопределено Тогда
			лНоваяСтрока.Обновлять = Истина;
			лНоваяСтрока.Предприятие = лВыборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.Предприятия.Количество() = 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru = 'Нет подходящих данных для заполнения'") );
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникПредприятияНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого лСтрокаТЧ Из Объект.Предприятия Цикл
	
		Если Не лСтрокаТЧ.Обновлять Тогда
			Продолжить;
		КонецЕсли;
		
		лПредприятие = лСтрокаТЧ.Предприятие.ПолучитьОбъект();
		лПредприятие.Заблокировать();
		лПредприятие.ДМ_НомерПланта = лСтрокаТЧ.ДМ_НомерПланта;
		Если ЗначениеЗаполнено( лСтрокаТЧ.Организация ) Тогда
			лПредприятие.ДМ_Организация = лСтрокаТЧ.Организация;
		КонецЕсли;
		лПредприятие.Записать();
		лПредприятие.Разблокировать();
		
		лСтрокаТЧ.Обновлять = Ложь;
		лСтрокаТЧ.Выполнено = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникПредприятия(Команда)
	ОбновитьСправочникПредприятияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредприятияПредприятиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Предприятия.ТекущиеДанные.Предприятие) Тогда
		лЗначенияРеквизитов = ЗначенияРеквизитовПредприятия( Элементы.Предприятия.ТекущиеДанные.Предприятие );
		лНомерПланта = лЗначенияРеквизитов.ДМ_НомерПланта;
		Если ЗначениеЗаполнено(лНомерПланта) Тогда
			Элементы.Предприятия.ТекущиеДанные.ДМ_НомерПланта = лНомерПланта;
		КонецЕсли;
		Если ЗначениеЗаполнено(лЗначенияРеквизитов.ДМ_Организация) Тогда
			Элементы.Предприятия.ТекущиеДанные.Организация = лЗначенияРеквизитов.ДМ_Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значения некоторых реквизитов предприятия
//
// Параметры:
//  пСсылка  - СправочникСсылка.Предприятия - Предприятие, для которого нужно
//                 получить реквизиты
//
// Возвращаемое значение:
//   Структура   - Структура со значениями ревизитов
//
&НаСервереБезКонтекста
Функция ЗначенияРеквизитовПредприятия( пСсылка )

	лЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта( пСсылка, "ДМ_НомерПланта,ДМ_Организация" );
	Возврат лЗначенияРеквизитов;

КонецФункции // ЗначенияРеквизитовПредприятия()
